hotRoom7A_HW/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        initABL         0;
        kappa           0.4;
        Cmu             0.09;
        C1              0;
        C2              1;
        flowDir         constant (1 0 0);
        zDir            constant (0 0 1);
        Uref            constant 10;
        Zref            constant 6;
        z0              constant 0.01;
        d               constant 0;
        value           nonuniform List<vector> 
250
(
(6.14484917144 0 0)
(6.14484917144 0 0)
(6.14484917144 0 0)
(6.14484917144 0 0)
(6.14484917144 0 0)
(7.88010255846 0 0)
(7.88010255846 0 0)
(7.88010255846 0 0)
...
)
;
    }
    ground
    {
        type            noSlip;
    }
    top
    {
        type            fixedShearStress;
        tau             (0.390796574 0 0);
        value           uniform (0 0 0);
    }
    sides
    {
        type            symmetry;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
