hotRoom7A_HW/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        initABL         0;
        kappa           0.4;
        Cmu             0.09;
        C1              0;
        C2              1;
        flowDir         constant (1 0 0);
        zDir            constant (0 0 1);
        Uref            constant 10;
        Zref            constant 6;
        z0              constant 0.01;
        d               constant 0;
        value           nonuniform List<scalar> 
250
(
1.19753903719
1.19753903719
1.19753903719
1.19753903719
1.19753903719
0.394534099745
0.394534099745
0.394534099745
...
)
;
    }
    ground
    {
        lowReCorrection 0;
        blending        stepwise;
        n               2;
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    top
    {
        type            zeroGradient;
    }
    sides
    {
        type            symmetry;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
