hotRoom7A_HW/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1.3;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletK;
        initABL         0;
        kappa           0.4;
        Cmu             0.09;
        C1              0;
        C2              1;
        flowDir         constant (1 0 0);
        zDir            constant (0 0 1);
        Uref            constant 10;
        Zref            constant 6;
        z0              constant 0.01;
        d               constant 0;
        value           uniform 1.30265524426;
    }
    ground
    {
        type            kqRWallFunction;
        value           uniform 1.3;
    }
    top
    {
        type            zeroGradient;
    }
    sides
    {
        type            symmetry;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.3;
        value           uniform 1.3;
    }
}


// ************************************************************************* //
