hotRoom7A_HW/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   uniform 0.0007;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletOmega;
        initABL         0;
        kappa           0.4;
        Cmu             0.09;
        C1              0;
        C2              1;
        flowDir         constant (1 0 0);
        zDir            constant (0 0 1);
        Uref            constant 10;
        Zref            constant 6;
        z0              constant 0.01;
        d               constant 0;
        value           nonuniform List<scalar> 
250
(
10.2145132879
10.2145132879
10.2145132879
10.2145132879
10.2145132879
3.36521289012
3.36521289012
3.36521289012
...
)
;
    }
    ground
    {
        blending        binomial2;
        n               2;
        beta1           0.075;
        type            omegaWallFunction;
        value           uniform 0.0007;
    }
    top
    {
        type            zeroGradient;
    }
    sides
    {
        type            symmetry;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0007;
        value           uniform 0.0007;
    }
}


// ************************************************************************* //
