hotRoom7A_HW/system/atm-HargreavesWright-2007/epsilon-HW-RH-Fig6c
# Hargreaves, D. M., & Wright, N. G. (2007).
# On the use of the k–ε model in commercial CFD software
# to model the neutral atmospheric boundary layer.
# Journal of wind engineering and
# industrial aerodynamics, 95(5), 355-369.
# DOI:10.1016/j.jweia.2006.08.002
# Fig. 6c
0.0020701794999818555, 49.592305129990216
0.002126271773891171, 48.292814797999284
0.002164558818180094, 47.16429009397673
0.0022035486578201443, 45.96736595968585
0.002263213410047251, 44.873073918499905
0.0023244936848750017, 43.77878187731396
0.002387462205022902, 42.54769097559135
0.0024740215292696124, 41.179834161034535
0.0025410406291819093, 39.948743259311925
0.002633152079108662, 38.64928587502344
0.0027286108031715625, 37.31562877560078
0.0028401715363583204, 35.70839042895602
0.0029826690252419655, 33.99858588461122
0.003132287402529308, 32.391380485668904
0.0033188290732853176, 30.442210883087387
0.003595390196335023, 28.390524504359476
0.003895115615003372, 25.99684097428992
0.004372395839556802, 23.329691513956814
0.004908099067927725, 20.799340914160364
0.0053644197877401765, 18.884486343671554
0.0057596497045315715, 17.721959610729485
0.006351093794633881, 16.08073570901643
0.0069412791686608594, 14.644677150405933
0.007791105651922957, 13.003519144097766
0.008667461744937913, 11.704325341428799
0.009815095638299107, 10.336798003896376
0.011164037426490142, 9.037686570483537
0.012698101857369398, 7.977973143009834
0.01489867869651591, 6.81577588709218
0.017636199130990377, 5.790410439413613
0.020876528350971663, 4.86764413713756
0.02549155925888904, 4.013392582088372
0.03210854870598559, 3.193456059131897
0.04246543677826559, 2.476299893941352
0.05793424483227349, 1.8276584759776568
0.07527116643710868, 1.4866332818580332
0.10592731524255083, 1.043305471657888
0.14840638796815175, 0.805159478411511
0.21543066611772452, 0.6697444213773878
0.30316307258220004, 0.5000143322505579
0.4519488475844894, 0.4330975485920945
0.6531567674299283, 0.29766601770675294
0.9565872888053345, 0.19648362350923776
