hotRoom7A_HW/system/atm-HargreavesWright-2007/k-HW-Fig6b-4000
# Hargreaves, D. M., & Wright, N. G. (2007).
# On the use of the k–ε model in commercial CFD software
# to model the neutral atmospheric boundary layer.
# Journal of wind engineering and
# industrial aerodynamics, 95(5), 355-369.
# DOI:10.1016/j.jweia.2006.08.002
# Fig. 6b - 4000
1.274623968947113, 49.543199450483584
1.2755943716642406, 48.54523075114714
1.2755943716642406, 47.306414508889745
1.2760795730228045, 46.03317000781064
1.2760795730228045, 44.82876532783818
1.2760795730228045, 43.65877221015063
1.2765647743813684, 42.38552770907153
1.2765647743813684, 41.14671146681413
1.2770499757399323, 39.907878528019964
1.2770499757399323, 38.703473848047494
1.2770499757399323, 37.499069168075025
1.2770499757399323, 36.08819511439299
1.2770499757399323, 34.952613558990365
1.2775351770984957, 33.78260374476606
1.2770499757399323, 32.578215761330355
1.277049975739932, 31.304987956788032
1.2765647743813684, 29.99736528649755
1.2765647743813684, 28.861783731094935
1.2760795730228045, 27.554161060804454
1.2755943716642406, 26.315361515083826
1.274623968947113, 24.973343979045183
1.274623968947113, 23.768939299072716
1.2736535662299855, 22.495744887603927
1.2731683648714216, 21.39459159102301
1.2721979621542938, 20.052574054984376
1.2712275594371665, 18.81379120580052
1.2702571567200387, 17.609419918901587
1.2692867540029111, 16.301813945147877
1.2688015526443472, 15.097425961712162
1.2678311499272197, 13.824231550243383
1.2663755458515285, 12.585465397596302
1.2658903444929646, 11.346665851875684
1.2658903444929646, 10.039026485048431
1.2658903444929646, 8.834621805075933
1.2658903444929646, 7.561394000533639
1.2668607472100921, 6.391367489772541
1.2692867540029111, 5.2901140139709995
1.2712275594371665, 4.0856425478514495
1.2760795730228045, 3.018717151650982
1.2852983988355167, 2.1236992980442153
1.2954876273653566, 1.5383521119282548
1.3066472586123243, 1.3314987178729467
1.3158660844250365, 1.1247121099647401
1.328481319747695, 1.0210433131539034
1.341581756428918, 0.9517693820912356
1.3575934012615236, 0.8823952718079369
1.3716642406598738, 0.8130879476717325
1.3876758854924793, 0.7781253996733568
1.4056283357593402, 0.7086845032429778
1.4201843765162545, 0.6393604825699981
1.432799611838913, 0.6389263726139447
1.4468704512372634, 0.6384421730475864
1.4619116933527414, 0.6035130181227615
1.4793789422610382, 0.5340888182291508
1.495390587093644, 0.5335378325157123
1.5080058224163029, 0.5331037225596802
1.5308102862688013, 0.4979074230465059
1.549247937894226, 0.4628613923642817
1.5657447840853955, 0.46229371011408205
1.5822416302765647, 0.4617260278638611
1.6026200873362444, 0.4266132110345495
1.6200873362445416, 0.39160057342586185
1.6424065987384764, 0.3908325327344002
1.6618146530810287, 0.39016467126356247
1.680737506065017, 0.389513506329493
1.6996603590490054, 0.3888623413954235
1.7229500242600682, 0.38806090763041823
1.7462396894711305, 0.3528479115804899
1.7656477438136826, 0.35218005010965925
1.7889374090247454, 0.35137861634463263
1.8131974769529355, 0.35054378950608367
1.8316351285783603, 0.3499093211087967
1.8510431829209124, 0.34924145963795894
1.8685104318292094, 0.3486403843142014
1.8898592916060166, 0.3134941744113604
1.913148956817079, 0.312692740646348
1.950024260067928, 0.31142380385176693
1.977195536147501, 0.27607723550765684