hotRoom7A_HW/system/atm-HargreavesWright-2007/k-RH-Fig6b
# Hargreaves, D. M., & Wright, N. G. (2007).
# On the use of the k–ε model in commercial CFD software
# to model the neutral atmospheric boundary layer.
# Journal of wind engineering and
# industrial aerodynamics, 95(5), 355-369.
# DOI:10.1016/j.jweia.2006.08.002
# Fig. 6b
1.3027210884353742, 0.3334523040892563
1.3027210884353742, 49.164263858422125
