hotRoom7A_HW/system/atm-HargreavesWright-2007/mut-HW-Fig6d-2500
# Hargreaves, D. M., & Wright, N. G. (2007).
# On the use of the k–ε model in commercial CFD software
# to model the neutral atmospheric boundary layer.
# Journal of wind engineering and
# industrial aerodynamics, 95(5), 355-369.
# DOI:10.1016/j.jweia.2006.08.002
# Fig. 6d - 2500
1.091431306845383, 0.577445652173914
2.4700813786500753, 1.3247282608695627
3.848731450454764, 2.0720108695652186
5.3997127812350385, 2.955163043478258
6.95069411201532, 3.7703804347826093
8.788894207754907, 4.789402173913047
10.971756821445666, 5.944293478260867
12.924844423168985, 7.03125
14.935375777884154, 8.118206521739125
17.290569650550502, 9.408967391304344
20.105313547151752, 10.9375
22.69028243178554, 12.398097826086953
25.102920057443754, 13.620923913043477
27.63044518908569, 15.08152173913043
30.617520344662523, 16.67798913043478
33.3748204882719, 18.172554347826086
35.84490186692197, 19.49728260869565
38.659645763523216, 21.0258152173913
41.18717089516515, 22.452445652173914
43.48492101483963, 23.743206521739125
46.127333652465296, 25.13586956521739
48.310196266156055, 26.324728260869563
50.37817137386308, 27.445652173913043
52.561033987553856, 28.702445652173914
54.51412158927717, 29.789402173913043
56.58209669698421, 30.978260869565215
58.42029679272379, 31.9633152173913
60.258496888463384, 33.05027173913044
62.15414073719482, 34.06929347826087
63.8774533269507, 35.05434782608695
65.5433221637147, 36.03940217391305
67.15174724748682, 37.02445652173913
69.10483484921015, 38.11141304347826
70.94303494494973, 39.19836956521739
72.32168501675443, 40.047554347826086
74.27477261847774, 41.202445652173914
76.11297271421732, 42.255434782608695
77.95117280995692, 43.34239130434783
79.55959789372905, 44.327445652173914
81.22546673049307, 45.346467391304344
83.1211105792245, 46.56929347826087
84.67209191000478, 47.452445652173914
86.16562948779321, 48.40353260869565
87.8314983245572, 49.49048913043478